app/Controllers/AdminController.php

SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '1'
SELECT *
FROM `opsi_jawaban`
WHERE `pertanyaan_id` = '1'
---
    public function editPertanyaan($id) {
        $data['pertanyaan'] = $this->pertanyaanModel->find($id);
        if (empty($data['pertanyaan'])) { throw new \CodeIgniter\Exceptions\PageNotFoundException('Pertanyaan tidak ditemukan.'); }
        $data['kuesioner'] = $this->kuesionerModel->find($data['pertanyaan']['kuesioner_id']);
        $data['opsiJawaban'] = $this->opsiJawabanModel->where('pertanyaan_id', $id)->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function check_old_password(string $inputPassword, string $field, array $data, ?string &$error = null): bool
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

SELECT *
FROM `kuesioner`
---
    public function hasil() {
        // Logika untuk mengambil data hasil IKM dari database
        // Data ini akan digunakan untuk perhitungan dan tampilan grafik
        $kuesionerList = $this->kuesionerModel->findAll();