app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `kuesioner`
SELECT COUNT(*) AS `numrows`
FROM `kuesioner`
WHERE `is_active` = 1
SELECT COUNT(DISTINCT ip_address) as total_ips
FROM `jawaban_pengguna`
SELECT AVG(opsi_jawaban.nilai) as average_score
FROM `jawaban_pengguna`
LEFT JOIN `opsi_jawaban` ON `opsi_jawaban`.`id` = `jawaban_pengguna`.`opsi_jawaban_id`
WHERE `opsi_jawaban`.`nilai` IS NOT NULL
 LIMIT 1
SELECT *
FROM `kuesioner`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard() {
        $data['totalKuesioner'] = $this->kuesionerModel->countAllResults();
        $data['activeKuesioner'] = $this->kuesionerModel->where('is_active', 1)->countAllResults();

        $data['totalResponden'] = $this->jawabanPenggunaModel
                                     ->select('COUNT(DISTINCT ip_address) as total_ips')
                                     ->get()
                                     ->getRow('total_ips');

        $avgScoreResult = $this->jawabanPenggunaModel
                                 ->select('AVG(opsi_jawaban.nilai) as average_score')
                                 ->join('opsi_jawaban', 'opsi_jawaban.id = jawaban_pengguna.opsi_jawaban_id', 'left')
                                 ->where('opsi_jawaban.nilai IS NOT NULL')
                                 ->first();

        $data['ikmAverage'] = $avgScoreResult['average_score'] ? round($avgScoreResult['average_score'], 2) : 0;
        if ($data['ikmAverage'] > 5.0) $data['ikmAverage'] = 5.0;

        $data['recentKuesioner'] = $this->kuesionerModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

SELECT *
FROM `kuesioner`
---
    public function kuesioner() {
        $data['kuesioner'] = $this->kuesionerModel->findAll();

SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '4'
---
    public function editKuesioner($id) {
        $data['kuesioner'] = $this->kuesionerModel->find($id);

UPDATE `kuesioner` SET `nama_kuesioner` = 'Kuesioner Lab', `deskripsi` = 'Serah Ae', `is_active` = 1, `updated_at` = '2025-07-24 08:09:42'
WHERE `kuesioner`.`id` IN ('4')
---
    public function updateKuesioner($id) {
        // --- VALIDASI DIHILANGKAN ---
        $data = [
            'nama_kuesioner' => $this->request->getPost('nama_kuesioner'),
            'deskripsi'      => $this->request->getPost('deskripsi'),
            'is_active'      => $this->request->getPost('is_active') ? 1 : 0,
        ];
        if ($this->kuesionerModel->update($id, $data)) {

SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '1'
---
    public function pertanyaan($kuesionerId) {
        $data['kuesioner'] = $this->kuesionerModel->find($kuesionerId);

SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '1'
---
    public function createPertanyaan($kuesionerId) {
        $data['kuesioner'] = $this->kuesionerModel->find($kuesionerId);

SELECT *
FROM `pertanyaan`
WHERE `pertanyaan`.`id` = '1'
---
    public function deletePertanyaan($id) {
        $pertanyaan = $this->pertanyaanModel->find($id);

SELECT *
FROM `kuesioner`
SELECT COUNT(DISTINCT ip_address) as total_ips
FROM `jawaban_pengguna`
SELECT AVG(opsi_jawaban.nilai) as average_score
FROM `jawaban_pengguna`
LEFT JOIN `opsi_jawaban` ON `opsi_jawaban`.`id` = `jawaban_pengguna`.`opsi_jawaban_id`
WHERE `opsi_jawaban`.`nilai` IS NOT NULL
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `jawaban_pengguna`
JOIN `opsi_jawaban` ON `opsi_jawaban`.`id` = `jawaban_pengguna`.`opsi_jawaban_id`
WHERE `opsi_jawaban`.`nilai` >= 4
SELECT COUNT(*) AS `numrows`
FROM `jawaban_pengguna`
JOIN `opsi_jawaban` ON `opsi_jawaban`.`id` = `jawaban_pengguna`.`opsi_jawaban_id`
SELECT *
FROM `kuesioner`
WHERE `is_active` = 1
 LIMIT 1
---
    public function hasil() {
        $kuesionerList = $this->kuesionerModel->findAll();

        $data['kuesionerList'] = $kuesionerList; // Untuk dropdown filter

        $totalRespondenHasil = $this->jawabanPenggunaModel->select('COUNT(DISTINCT ip_address) as total_ips')->get()->getRow('total_ips');
        $data['totalRespondenHasil'] = $totalRespondenHasil;

        $avgIkmResult = $this->jawabanPenggunaModel
                             ->select('AVG(opsi_jawaban.nilai) as average_score')
                             ->join('opsi_jawaban', 'opsi_jawaban.id = jawaban_pengguna.opsi_jawaban_id', 'left')
                             ->where('opsi_jawaban.nilai IS NOT NULL')
                             ->first();
        $ikmRataRataHasil = round($avgIkmResult['average_score'] ?? 0, 2);
        $data['ikmRataRataHasil'] = $ikmRataRataHasil;

        // Perhitungan persentase puas (contoh: nilai 4 atau 5 dianggap puas dari skala 1-5)
        $totalPuas = $this->jawabanPenggunaModel
                          ->select('COUNT(jawaban_pengguna.id) as count_puas')
                          ->join('opsi_jawaban', 'opsi_jawaban.id = jawaban_pengguna.opsi_jawaban_id')
                          ->where('opsi_jawaban.nilai >=', 4)
                          ->countAllResults();
        $totalSemuaJawabanSkala = $this->jawabanPenggunaModel
                                     ->select('COUNT(jawaban_pengguna.id) as count_all_skala')
                                     ->join('opsi_jawaban', 'opsi_jawaban.id = jawaban_pengguna.opsi_jawaban_id')
                                     ->countAllResults();

        $data['persentasePuasHasil'] = ($totalSemuaJawabanSkala > 0) ? round(($totalPuas / $totalSemuaJawabanSkala) * 100, 2) : 0;

        // Detail hasil per pertanyaan (untuk kuesioner pertama yang aktif, atau yang dipilih)
        $activeKuesioner = $this->kuesionerModel->where('is_active', 1)->first();

SELECT COUNT(*) AS `numrows`
FROM `jawaban_pengguna`
WHERE `pertanyaan_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `jawaban_pengguna`
WHERE `opsi_jawaban_id` = '1'
---
                ];

                if ($pertanyaan['jenis_jawaban'] !== 'isian') {
                    $totalJawabanPertanyaan = $this->jawabanPenggunaModel->where('pertanyaan_id', $pertanyaan['id'])->countAllResults();
                    foreach ($pertanyaan['opsi'] as $opsi) {
                        $count = $this->jawabanPenggunaModel->where('opsi_jawaban_id', $opsi['id'])->countAllResults();

SELECT AVG(opsi_jawaban.nilai) as avg_score
FROM `jawaban_pengguna`
LEFT JOIN `opsi_jawaban` ON `opsi_jawaban`.`id` = `jawaban_pengguna`.`opsi_jawaban_id`
WHERE `jawaban_pengguna`.`pertanyaan_id` = '1'
AND `opsi_jawaban`.`nilai` IS NOT NULL
 LIMIT 1
SELECT *
FROM `jawaban_pengguna`
WHERE `pertanyaan_id` = '3'
AND `jawaban_teks` IS NOT NULL
---
                        ];
                    }
                    if ($pertanyaan['jenis_jawaban'] === 'skala') {
                        $avgNilai = $this->jawabanPenggunaModel
                                         ->select('AVG(opsi_jawaban.nilai) as avg_score')
                                         ->join('opsi_jawaban', 'opsi_jawaban.id = jawaban_pengguna.opsi_jawaban_id', 'left')
                                         ->where('jawaban_pengguna.pertanyaan_id', $pertanyaan['id'])
                                         ->where('opsi_jawaban.nilai IS NOT NULL')
                                         ->first();
                        $detail['statistik']['rata_rata_nilai'] = round($avgNilai['avg_score'] ?? 0, 2);
                    }
                } else {
                    $saran = $this->jawabanPenggunaModel->where('pertanyaan_id', $pertanyaan['id'])->where('jawaban_teks IS NOT NULL')->findAll();