app/Controllers/AuthController.php

    public function processLogin()
    {
        $session = session(); // Ambil instance session
        $username = $this->request->getPost('username'); // Ambil username dari form
        $password = $this->request->getPost('password'); // Ambil password dari form

        // Cari user di database berdasarkan username
        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1