app/Controllers/KuesionerController.php

    public function index()
    {
        $data['kuesioner'] = $this->kuesionerModel->where('is_active', 1)->findAll();
---
SELECT *
FROM `kuesioner`
WHERE `is_active` = 1

    public function start_survey($kuesionerId)
    {
        $kuesioner = $this->kuesionerModel->find($kuesionerId);
---
SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '4'

    public function question($questionNumber)
    {
        $kuesionerId = session()->get('current_kuesioner_id');
        if (!$kuesionerId) {
            return redirect()->to(base_url('kuesioner'))->with('error', 'Sesi kuesioner tidak ditemukan. Silakan mulai ulang.');
        }

        $kuesioner = $this->kuesionerModel->find($kuesionerId);
        // Ambil semua pertanyaan, termasuk urutan 0 untuk pendahuluan
        $allQuestions = $this->pertanyaanModel->where('kuesioner_id', $kuesionerId)->orderBy('urutan', 'ASC')->findAll();
---
SELECT *
FROM `kuesioner`
WHERE `kuesioner`.`id` = '2'
SELECT *
FROM `pertanyaan`
WHERE `kuesioner_id` = '2'
ORDER BY `urutan` ASC


        $currentQuestion = $displayQuestions[$currentQuestionIndex];
        // Ambil opsi jawaban untuk pertanyaan saat ini
        $currentQuestion['opsi'] = $this->opsiJawabanModel->where('pertanyaan_id', $currentQuestion['id'])->findAll();
---
SELECT *
FROM `opsi_jawaban`
WHERE `pertanyaan_id` = '16'