app/Models/PertanyaanModel.php

    public function getPertanyaanWithOpsi($kuesionerId)
    {
        $pertanyaan = $this->where('kuesioner_id', $kuesionerId)
                           ->orderBy('urutan', 'ASC')
                           ->findAll();
        $opsiJawabanModel = new OpsiJawabanModel();
        foreach ($pertanyaan as &$p) {
            if ($p['jenis_jawaban'] !== 'isian') {
                $p['opsi'] = $opsiJawabanModel->where('pertanyaan_id', $p['id'])->findAll();
---
SELECT *
FROM `pertanyaan`
WHERE `kuesioner_id` = '1'
ORDER BY `urutan` ASC
SELECT *
FROM `opsi_jawaban`
WHERE `pertanyaan_id` = '1'